
Процедура ОбработкаПроведения(Отказ, Режим)
	
	РеквизитыДоговора = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Договор, 
	"ВидДоговора, ВКМ_ДатаНачалаДействия, ВКМ_ДатаОкончанияДействия, ВКМ_СтоимостьЧасаРаботы");
	
	Если РеквизитыДоговора.ВидДоговора <> Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбоненскоеОбслуживание Тогда
		Отказ = Истина;
		ОбщегоНазначения.СообщитьПользователю("Договор без абоненского обслуживания, проведение документа не возможно");	
	КонецЕсли;
	
	Если Дата < РеквизитыДоговора.ВКМ_ДатаНачалаДействия ИЛИ Дата > РеквизитыДоговора.ВКМ_ДатаОкончанияДействия Тогда
		Отказ = Истина;
		ОбщегоНазначения.СообщитьПользователю("Дата документа находится за периодом действия договора, проведение документа не возможно");		
	КонецЕсли;
	
	
	Если Не Отказ Тогда 
		
		// регистр ВКМ_ВыполненныеКлиентуРаботы Приход			
		Движения.ВКМ_ВыполненныеКлиентуРаботы.Записывать = Истина;
		
		Движение = Движения.ВКМ_ВыполненныеКлиентуРаботы.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Клиент = Клиент;
		Движение.Договор = Договор;
		Движение.КоличествоЧасов = ВыполненныеРаботы.Итог("ЧасыКОплатеКлиенту");
		Движение.СуммаКОплате = Движение.КоличествоЧасов * РеквизитыДоговора.ВКМ_СтоимостьЧасаРаботы;
				
	КонецЕсли;
 
	
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
