
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Функция возвращает JSON-строку содержащую уникальные идентификаторы ссылкок на объекты справочника ДоговорыКонтрогентов и документа РеализацияТоваровИУслуг
//
// Параметры:
//  ДатаНачала  - Дата - начало месяца
//  ДатаОкончания  - Дата - конец месяца
//
// Возвращаемое значение:
//  Строка - JSON-строкe
//
Функция ПолучитьДокументыРеализации(ДатаНачала, ДатаОкончания) Экспорт
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДоговорыКонтрагентов.Организация КАК Организация,
		|	ДоговорыКонтрагентов.Владелец КАК Контрагент,
		|	ДоговорыКонтрагентов.Ссылка КАК Договор,
		|	ДоговорыКонтрагентов.ВКМ_ДатаНачалаДействия КАК ВКМ_ДатаНачалаДействия,
		|	ДоговорыКонтрагентов.ВКМ_ДатаОкончанияДействия КАК ВКМ_ДатаОкончанияДействия,
		|	РеализацияТоваровУслуг.Ссылка КАК Реализация
		|ИЗ
		|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
		|		ПО ДоговорыКонтрагентов.Организация = РеализацияТоваровУслуг.Организация
		|			И ДоговорыКонтрагентов.Владелец = РеализацияТоваровУслуг.Контрагент
		|			И ДоговорыКонтрагентов.Ссылка = РеализацияТоваровУслуг.Договор
		|			И (РеализацияТоваровУслуг.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания)
		|ГДЕ
		|	ДоговорыКонтрагентов.ВидДоговора = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровКонтрагентов.ВКМ_АбоненскоеОбслуживание)
		|	И ДоговорыКонтрагентов.ВКМ_ДатаНачалаДействия <= &ДатаНачала
		|	И ДоговорыКонтрагентов.ВКМ_ДатаОкончанияДействия >= &ДатаОкончания";
	
	Запрос.УстановитьПараметр("ДатаНачала", ДатаНачала);
	Запрос.УстановитьПараметр("ДатаОкончания", ДатаОкончания);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	УИДРеализаций = Новый Массив;	
	
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		
		Если ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.Реализация) Тогда
			
			ОбъектДокумента = ВыборкаДетальныеЗаписи.Реализация.ПолучитьОбъект();
			ОбъектДокумента.ВКМ_ВыполнитьАвтозаполнение();
			ОбъектДокумента.Записать(РежимЗаписиДокумента.Проведение);
						
			ДоговорУИД = Строка(ВыборкаДетальныеЗаписи.Договор.УникальныйИдентификатор());
			РеализацияУИД = Строка(ВыборкаДетальныеЗаписи.Реализация.УникальныйИдентификатор());
			
			ДанныеДляТЧСписокДоговоров = Новый Структура;
			ДанныеДляТЧСписокДоговоров.Вставить("Договор", ДоговорУИД);
			ДанныеДляТЧСписокДоговоров.Вставить("Реализация", РеализацияУИД);
				
			УИДРеализаций.Добавить(ДанныеДляТЧСписокДоговоров);
			
		КонецЕсли;
		
		
		Если Не ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.Реализация) Тогда
			
			НовыйДок = Документы.РеализацияТоваровУслуг.СоздатьДокумент();
			НовыйДок.Дата = ДатаОкончания; 
			НовыйДок.Организация = ВыборкаДетальныеЗаписи.Организация;
			НовыйДок.Контрагент = ВыборкаДетальныеЗаписи.Контрагент;			
			НовыйДок.Договор = ВыборкаДетальныеЗаписи.Договор;
			НовыйДок.ВКМ_ВыполнитьАвтозаполнение();
			НовыйДок.Комментарий = "Документ создан при помощи механизма ""Массовое создание актов""";
			
			Попытка	
				
				НовыйДок.Записать();
				
				Если Не НовыйДок.ПроверитьЗаполнение() Тогда
					Продолжить;
				КонецЕсли; 
				
				НовыйДок.Записать(РежимЗаписиДокумента.Проведение); 
				
				НовыйДокСсылка = НовыйДок.Ссылка;
	
				ДоговорУИД = Строка(ВыборкаДетальныеЗаписи.Договор.УникальныйИдентификатор());
				РеализацияУИД = Строка(НовыйДокСсылка.УникальныйИдентификатор());
				
				ДанныеДляТЧСписокДоговоров = Новый Структура;
				ДанныеДляТЧСписокДоговоров.Вставить("Договор", ДоговорУИД);
				ДанныеДляТЧСписокДоговоров.Вставить("Реализация", РеализацияУИД);
				
				УИДРеализаций.Добавить(ДанныеДляТЧСписокДоговоров);
				
			Исключение
				ВызватьИсключение;
			КонецПопытки; 
			
		КонецЕсли; 
		
		
	КонецЦикла;
	
	
	Возврат ЗаписатьЗначениеJSON(УИДРеализаций);
	
КонецФункции    

#КонецОбласти

#КонецЕсли
