
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// ++ Исаев Д.А. Задача: диплом от 20.01.2026
	Группа = Элементы.Добавить("НовыеРеквизиты", Тип("ГруппаФормы"));
	Группа.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	Группа.Заголовок = "Реквизиты для договора с абоненским обслуживанием";
	Группа.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
	
	Если Объект.ВидДоговора = ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.ВКМ_АбоненскоеОбслуживание") Тогда
		Элементы.НовыеРеквизиты.Видимость = Истина;
	Иначе
		Элементы.НовыеРеквизиты.Видимость = Ложь;
	КонецЕсли;

	
	Поле1 = Элементы.Добавить("ВКМ_ДатаНачалаДействия", Тип("ПолеФормы"), Группа);
	Поле1.Вид = ВидПоляФормы.ПолеВвода;
	Поле1.ПутьКДанным = "Объект.ВКМ_ДатаНачалаДействия"; 
	
	Поле2 = Элементы.Добавить("ВКМ_ДатаОкончанияДействия", Тип("ПолеФормы"), Группа);
	Поле2.Вид = ВидПоляФормы.ПолеВвода;
	Поле2.ПутьКДанным = "Объект.ВКМ_ДатаОкончанияДействия";
	Поле2.УстановитьДействие("ПриИзменении", "ВКМ_ДатаОкончанияДействияПриИзменении");
	
	Поле3 = Элементы.Добавить("ВКМ_СуммаАбоненскойПлаты", Тип("ПолеФормы"), Группа);
	Поле3.Вид = ВидПоляФормы.ПолеВвода;
	Поле3.ПутьКДанным = "Объект.ВКМ_СуммаАбоненскойПлаты"; 
	
	Поле4 = Элементы.Добавить("ВКМ_СтоимостьЧасаРаботы", Тип("ПолеФормы"), Группа);
	Поле4.Вид = ВидПоляФормы.ПолеВвода;
	Поле4.ПутьКДанным = "Объект.ВКМ_СтоимостьЧасаРаботы";	
	// -- Исаев Д.А. от 20.01.2026  
	
КонецПроцедуры

&НаКлиенте
Процедура ВидДоговораПриИзменении(Элемент)
	
	// ++ Исаев Д.А. Задача: диплом от 20.01.2026
	Если Объект.ВидДоговора = ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.ВКМ_АбоненскоеОбслуживание") Тогда
		Элементы.НовыеРеквизиты.Видимость = Истина;
	Иначе
		Элементы.НовыеРеквизиты.Видимость = Ложь;
	КонецЕсли;	
	// -- Исаев Д.А. от 20.01.2026
	
КонецПроцедуры 

&НаКлиенте
Процедура ВКМ_ДатаОкончанияДействияПриИзменении(Элемент)
	
	// ++ Исаев Д.А. Задача: диплом от 20.01.2026
    Объект.ВКМ_ДатаОкончанияДействия = КонецДня(Объект.ВКМ_ДатаОкончанияДействия);
	// -- Исаев Д.А. от 20.01.2026
	
КонецПроцедуры 
