
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты) 
	
	// ++ Исаев Д.А. Диплом от 28.01.2026
	// Задача: "Работа с заявкам клиентов"
	Если ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбоненскоеОбслуживание Тогда
		ПроверяемыеРеквизиты.Добавить("ВКМ_ДатаНачалаДействия");		
		ПроверяемыеРеквизиты.Добавить("ВКМ_ДатаОкончанияДействия"); 
		ПроверяемыеРеквизиты.Добавить("ВКМ_СтоимостьЧасаРаботы");		
	КонецЕсли; 		
	// -- Исаев Д.А. от 28.01.2026
		
КонецПроцедуры 

#КонецОбласти 

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли

